In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('app_train_new.csv')
df1 = pd.read_csv('app_test_new.csv')

In [3]:
full = pd.concat([df,df1],ignore_index=True)

In [4]:
dfLate = full[full['TARGET']==1].reset_index(drop=True)
dfOntime = full[full['TARGET']==0].reset_index(drop=True)

In [5]:
dfLate.head()

,TARGET,CONTRACT_TYPE,GENDER,NUM_CHILDREN,INCOME,APPROVED_CREDIT,ANNUITY,INCOME_TYPE,EDUCATION,FAMILY_STATUS,HOUSING_TYPE,DAYS_AGE,DAYS_WORK,DAYS_REGISTRATION,DAYS_ID_CHANGE,WEEKDAYS_APPLY,HOUR_APPLY,ORGANIZATION_TYPE
0,1,0,0,0,108000.0,225000.0,17775.0,Working,Higher education,Single / not married,With parents,14239,7652,2772,4275,WEDNESDAY,12,Other
1,1,0,1,0,270000.0,889515.0,31644.0,Working,Secondary / secondary special,Married,House / apartment,16755,920,2652,305,MONDAY,14,Business Entity Type 3
2,1,0,0,0,62100.0,314100.0,17167.5,Working,Secondary / secondary special,Single / not married,House / apartment,10508,1885,1832,1832,THURSDAY,9,Government
3,1,0,0,0,360000.0,443178.0,35145.0,Commercial associate,Higher education,Single / not married,Co-op apartment,10197,923,5021,2877,FRIDAY,19,Business Entity Type 3
4,1,0,0,1,135000.0,550980.0,33835.5,Working,Secondary / secondary special,Married,House / apartment,9213,668,1467,1289,TUESDAY,8,Kindergarten

In [6]:
dfOntime.head()

,TARGET,CONTRACT_TYPE,GENDER,NUM_CHILDREN,INCOME,APPROVED_CREDIT,ANNUITY,INCOME_TYPE,EDUCATION,FAMILY_STATUS,HOUSING_TYPE,DAYS_AGE,DAYS_WORK,DAYS_REGISTRATION,DAYS_ID_CHANGE,WEEKDAYS_APPLY,HOUR_APPLY,ORGANIZATION_TYPE
0,0,1,0,1,67500.0,202500.0,10125.0,Working,Secondary / secondary special,Married,With parents,11539,921,119,2757,TUESDAY,18,Business Entity Type 3
1,0,0,0,1,202500.0,976711.5,49869.0,Commercial associate,Secondary / secondary special,Married,House / apartment,15743,4482,1797,2455,TUESDAY,14,Other
2,0,0,0,0,180000.0,407520.0,25060.5,Pensioner,Secondary / secondary special,Married,House / apartment,20775,18250,8737,4312,THURSDAY,14,NA1
3,0,0,1,0,225000.0,808650.0,26086.5,State servant,Higher education,Married,House / apartment,20659,10455,4998,4010,WEDNESDAY,10,Culture
4,0,1,1,0,135000.0,180000.0,9000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,9013,1190,3524,1644,SUNDAY,11,Construction

In [7]:
print(dfLate.shape)
print(dfOntime.shape)

(6172, 18)
(70088, 18)

In [8]:
dfLate.describe()

,TARGET,CONTRACT_TYPE,GENDER,NUM_CHILDREN,INCOME,APPROVED_CREDIT,ANNUITY,DAYS_AGE,DAYS_WORK,DAYS_REGISTRATION,DAYS_ID_CHANGE,HOUR_APPLY
count,6172.0,6172.000000,6172.000000,6172.000000,6.172000e+03,6.172000e+03,6172.000000,6172.000000,6172.000000,6172.000000,6172.000000,6172.000000
mean,1.0,0.064323,0.431303,0.451879,1.602046e+05,5.502694e+05,26309.529974,14854.828743,3808.371841,4500.541478,2714.412346,11.727479
std,0.0,0.245347,0.495298,0.742783,8.234641e+04,3.423867e+05,12226.768388,4213.677912,5610.570879,3311.185895,1531.763322,3.285813
min,1.0,0.000000,0.000000,0.000000,2.925000e+04,4.500000e+04,2722.500000,7696.000000,4.000000,0.000000,3.000000,0.000000
25%,1.0,0.000000,0.000000,0.000000,1.125000e+05,2.844000e+05,17348.625000,11334.750000,700.000000,1676.750000,1350.750000,10.000000
50%,1.0,0.000000,0.000000,0.000000,1.350000e+05,4.905360e+05,25074.000000,14195.000000,1464.500000,4035.000000,2768.000000,12.000000
75%,1.0,0.000000,1.000000,1.000000,2.025000e+05,7.284600e+05,32746.500000,17965.500000,3318.500000,6666.500000,4110.000000,14.000000
max,1.0,1.000000,1.000000,9.000000,1.350000e+06,2.961000e+06,105511.500000,25142.000000,18250.000000,22928.000000,6189.000000,23.000000

In [9]:
dfOntime.describe()

,TARGET,CONTRACT_TYPE,GENDER,NUM_CHILDREN,INCOME,APPROVED_CREDIT,ANNUITY,DAYS_AGE,DAYS_WORK,DAYS_REGISTRATION,DAYS_ID_CHANGE,HOUR_APPLY
count,70088.0,70088.000000,70088.000000,70088.000000,7.008800e+04,7.008800e+04,70088.000000,70088.000000,70088.000000,70088.000000,70088.000000,70088.000000
mean,0.0,0.098234,0.333367,0.408315,1.690702e+05,6.015325e+05,27157.345516,16156.745663,5422.044416,5021.474903,3023.829129,12.086577
std,0.0,0.297632,0.471420,0.712627,9.992109e+04,4.057837e+05,14624.520401,4362.033501,6545.117076,3536.327845,1507.103780,3.264112
min,0.0,0.000000,0.000000,0.000000,2.610000e+04,4.500000e+04,2164.500000,7673.000000,1.000000,0.000000,0.000000,0.000000
25%,0.0,0.000000,0.000000,0.000000,1.125000e+05,2.700000e+05,16456.500000,12569.750000,974.000000,2023.000000,1756.000000,10.000000
50%,0.0,0.000000,0.000000,0.000000,1.485000e+05,5.172660e+05,24817.500000,15865.000000,2318.000000,4545.000000,3310.000000,12.000000
75%,0.0,0.000000,1.000000,1.000000,2.025000e+05,8.100000e+05,34777.125000,19825.000000,6172.250000,7565.000000,4319.000000,14.000000
max,0.0,1.000000,1.000000,8.000000,4.500000e+06,4.050000e+06,225000.000000,25229.000000,18250.000000,21865.000000,6337.000000,23.000000

##### Find correlation between age & workyears based on payment status

In [15]:
print('Umur min late payment =', round(np.min(dfLate['DAYS_AGE'])/365))
print('Umur mean late payment =', round(np.mean(dfLate['DAYS_AGE'])/365))
print('Umur max late payment =', round(np.max(dfLate['DAYS_AGE'])/365))

print('Umur min ontime payment =', round(np.min(dfOntime['DAYS_AGE'])/365))
print('Umur mean ontime payment =', round(np.mean(dfOntime['DAYS_AGE'])/365))
print('Umur max ontime payment =', round(np.max(dfOntime['DAYS_AGE'])/365))

Umur min late payment = 21
Umur mean late payment = 41
Umur max late payment = 69
Umur min ontime payment = 21
Umur mean ontime payment = 44
Umur max ontime payment = 69

In [16]:
print('Thn kerja min late payment =', round(np.min(dfLate['DAYS_WORK'])/365))
print('Thn kerja mean late payment =', round(np.mean(dfLate['DAYS_WORK'])/365))
print('Thn kerja max late payment =', round(np.max(dfLate['DAYS_WORK'])/365))

print('Thn kerja min ontime payment =', round(np.min(dfOntime['DAYS_WORK'])/365))
print('Thn kerja mean ontime payment =', round(np.mean(dfOntime['DAYS_WORK'])/365))
print('Thn kerja max ontime payment =', round(np.max(dfOntime['DAYS_WORK'])/365))

Thn kerja min late payment = 0
Thn kerja mean late payment = 10
Thn kerja max late payment = 50
Thn kerja min ontime payment = 0
Thn kerja mean ontime payment = 15
Thn kerja max ontime payment = 50

In [17]:
sis1 = pd.DataFrame(round(dfLate['DAYS_WORK'])/365)
sis2 = pd.DataFrame(round(dfLate['DAYS_AGE'])/365)

dfLate1 = pd.concat([dfLate, sis1], ignore_index=True, sort=False, axis=1).reset_index(drop=True)
dfLate1 = dfLate1.rename({18:'DAYWORK'}, axis=1)
dfLate2 = pd.concat([dfLate, sis2], ignore_index=True, sort=False, axis=1).reset_index(drop=True)
dfLate2 = dfLate2.rename({18:'DAYAGE'}, axis=1)

In [18]:
sis3 = pd.DataFrame(round(dfOntime['DAYS_WORK'])/365)
sis4 = pd.DataFrame(round(dfOntime['DAYS_AGE'])/365)

dfOntime1 = pd.concat([dfOntime, sis3], ignore_index=True, sort=False, axis=1).reset_index(drop=True)
dfOntime1 = dfOntime1.rename({18:'DAYWORKS'}, axis=1)
dfOntime2 = pd.concat([dfOntime, sis4], ignore_index=True, sort=False, axis=1).reset_index(drop=True)
dfOntime2 = dfOntime2.rename({18:'DAYAGES'}, axis=1)

##### Work years tuning both affected to decrease customers with late and on-time payment

In [19]:
print(dfLate.shape)
dfLatee = dfLate1[dfLate1['DAYWORK'] > 2]
print(dfLatee.shape)

print(dfOntime.shape)
dfOntimee = dfOntime1[dfOntime1['DAYWORKS'] > 2]
print(dfOntimee.shape)

(6172, 18)
(4564, 19)
(70088, 18)
(56936, 19)

##### Age tuning both affected to decrease customers with late and on-time payment

In [20]:
print(dfLate.shape)
dfLatee1 = dfLate2[dfLate2['DAYAGE'] > 25]
print(dfLatee1.shape)

print(dfOntime.shape)
dfOntimee1 = dfOntime2[dfOntime2['DAYAGES'] > 25]
print(dfOntimee1.shape)

(6172, 18)
(5808, 19)
(70088, 18)
(67501, 19)

##### Work years and ages tuning not only affected to decrease customers with late payment but also with on-time payment

In [21]:
print(dfLate.shape)
dfLatee2 = dfLate1[(dfLate1['DAYWORK'] > 2) & (dfLate2['DAYAGE'] > 25)]
print(dfLatee2.shape)

print(dfOntime.shape)
dfOntimee2 = dfOntime1[(dfOntime1['DAYWORKS'] > 2) & (dfOntime2['DAYAGES'] > 25)]
print(dfOntimee2.shape)

(6172, 18)
(4404, 19)
(70088, 18)
(55676, 19)

##### See correlations between approved credit amount with customers income based on payment status

In [22]:
mea1 = np.mean(dfLate['APPROVED_CREDIT'] / np.mean(dfLate['INCOME']))
print(mea1)

mea2 = np.mean(dfOntime['APPROVED_CREDIT'] / np.mean(dfOntime['INCOME']))
print(mea2)

3.434791416361741
3.557886904975747

##### See correlations between approved credit amount with customers installment/month based on payment status

In [23]:
cub1 = np.mean(dfLate['APPROVED_CREDIT'] / np.mean(dfLate['ANNUITY']))
print(cub1)

cub2 = np.mean(dfOntime['APPROVED_CREDIT'] / np.mean(dfOntime['ANNUITY']))
print(cub2)

20.915213619893066
22.149899896518125

##### See customers cash flow based on their save amount income after paying the installment

In [24]:
dum = np.mean(dfLate['INCOME'] - dfLate['ANNUITY'])
print(dum)

dum1 = np.mean(dfOntime['INCOME'] - dfOntime['ANNUITY'])
print(dum1)

133895.08595268958
141912.8078344367

In [25]:
cum1 = pd.DataFrame(dfLate['INCOME'] - dfLate['ANNUITY'])
cum2 = pd.DataFrame(dfLate['APPROVED_CREDIT'] / dfLate['ANNUITY'])
cum3 = pd.DataFrame(dfLate['APPROVED_CREDIT'] / dfLate['INCOME'])

dfLat1 = pd.concat([dfLate, cum1], ignore_index=True, sort=False, axis=1).reset_index(drop=True)
dfLat1 = dfLat1.rename({18:'SAVE_MONEY1'}, axis=1)
dfLat2 = pd.concat([dfLate, cum2], ignore_index=True, sort=False, axis=1).reset_index(drop=True)
dfLat2 = dfLat2.rename({18:'COMP_ANN1'}, axis=1)
dfLat3 = pd.concat([dfLate, cum3], ignore_index=True, sort=False, axis=1).reset_index(drop=True)
dfLat3 = dfLat3.rename({18:'COMP_INC1'}, axis=1)

In [26]:
cum4 = pd.DataFrame(dfOntime['INCOME'] - dfOntime['ANNUITY'])
cum5 = pd.DataFrame(dfOntime['APPROVED_CREDIT'] / dfOntime['ANNUITY'])
cum6 = pd.DataFrame(dfOntime['APPROVED_CREDIT'] / dfOntime['INCOME'])

dfOntim1 = pd.concat([dfOntime, cum4], ignore_index=True, sort=False, axis=1).reset_index(drop=True)
dfOntim1 = dfOntim1.rename({18:'SAVE_MONEY2'}, axis=1)
dfOntim2 = pd.concat([dfOntime, cum5], ignore_index=True, sort=False, axis=1).reset_index(drop=True)
dfOntim2 = dfOntim2.rename({18:'COMP_ANN2'}, axis=1)
dfOntim3 = pd.concat([dfOntime, cum6], ignore_index=True, sort=False, axis=1).reset_index(drop=True)
dfOntim3 = dfOntim3.rename({18:'COMP_INC2'}, axis=1)

##### cashflow tuning both affected to decrease customers with late and on-time payment

In [27]:
print(dfLate.shape)
dfLa1 = dfLat1[dfLat1['SAVE_MONEY1'] > 140000]
print(dfLa1.shape)

print(dfOntime.shape)
dfOnt1 = dfOntim1[dfOntim1['SAVE_MONEY2'] > 140000]
print(dfOnt1.shape)

(6172, 18)
(2220, 19)
(70088, 18)
(27974, 19)

##### the calculation result of approved credit with installment tuning both affected to decrease customers with late and on-time payment

In [28]:
print(dfLate.shape)
dfLa2 = dfLat2[dfLat2['COMP_ANN1'] > 22]
print(dfLa2.shape)

print(dfOntime.shape)
dfOnt2 = dfOntim2[dfOntim2['COMP_ANN2'] > 22]
print(dfOnt2.shape)

(6172, 18)
(1893, 19)
(70088, 18)
(28442, 19)

##### the calculation result of approved credit with income tuning both affected to decrease customers with late and on-time payment

In [29]:
print(dfLate.shape)
dfLa3 = dfLat3[dfLat3['COMP_INC1'] < 3.4]
print(dfLa3.shape)

print(dfOntime.shape)
dfOnt3 = dfOntim3[dfOntim3['COMP_INC2'] < 3.4]
print(dfOnt3.shape)

(6172, 18)
(3341, 19)
(70088, 18)
(37039, 19)

#### Insight 
- Unemployed customers have a low total income, but highly in the total loan amount
- The important feature doesn't fit to be the most consideration to become feature tuning in order to decrease customers late payment
- It also shows that feature tuning not only decrease customers with late payment but also customers with on-time payment

#### Recommendations 
- Add a new feature such as credit history/problems to see customers with late payment behavior and payment history
- Consider to including customer's credit score as a feature to see customers capacity to repay a loan and oversee the potential risk